nc: 4

scales:
  # [depth, width, max_channels]
  # n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  # m: [ 0.50, 1.00, 512 ] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  # l: [ 1.00, 1.00, 512 ] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  # x: [ 1.00, 1.50, 512 ] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 640*640*3 -> 320*320*64*w
  - [-1, 1, Conv, [128, 3, 2]] # 160*160*128*w
  - [-1, 2, C3k2, [256, False, 0.25]]  # 160*160*256*w

  - [-1, 1, Conv, [256, 3, 2]] # 80*80*256*w
  - [-1, 2, C3k2, [512, False, 0.25]] # 80*80*512*w

  - [ -1, 1, Conv, [ 512, 3, 2 ] ]
  - [ -1, 2, DGBConv, [ 512 ] ]  # 6

  - [ -1, 1, Conv, [ 1024, 3, 2 ] ]
  - [ -1, 2, DGBConv, [ 1024 ] ]  # 8

  - [-1, 1, SPPF, [1024, 5]] # 20*20*512*w*r
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 40*40*512*w*r
  - [[-1, 6], 1, Concat, [1]] # cat backbone upP4&P3 40*40*512*w*(1+r)
  - [-1, 2, C3k2, [512, False]] # 13 40*40*512*w

  - [-1, 1, DSAM_CrossAttention, []] # 新增DSAM层

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 80*80*512*w
  - [[-1, 4], 1, Concat, [1]] # cat backbone upP3&P2 80*80*1024*w
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small) 80*80*256*w


  - [-1, 1, Conv, [256, 3, 2]] # 40*40*256*w
  - [[-1, 13], 1, Concat, [1]] # cat head P4 40*40*768*w
  - [-1, 2, C3k2, [512, False]] # 19 (P4/16-medium) 40*40*512*w

  - [-1, 1, DSAM_CrossAttention, []] # 新增DSAM层

  - [-1, 1, Conv, [512, 3, 2]] # 20*20*512*w
  - [[-1, 10], 1, Concat, [1]] # cat head P5 20*20*512*(1+r)
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large) 20*20*512*w*r1

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
